lerouxb/arduino-config-parser/output/Arduino-nRF5/boards.txt
Sinobit.vid.0=0x0d28
Sinobit.pid.0=0x0204

Sinobit.upload.tool=sandeepmistry:openocd
Sinobit.upload.protocol=cmsis-dap
Sinobit.upload.target=nrf51
Sinobit.upload.maximum_size=262144
Sinobit.upload.setup_command=transport select swd;
Sinobit.upload.use_1200bps_touch=false
Sinobit.upload.wait_for_upload_port=false
Sinobit.upload.native_usb=false

Sinobit.bootloader.tool=sandeepmistry:openocd

Sinobit.build.mcu=cortex-m0
Sinobit.build.f_cpu=16000000
Sinobit.build.board=SINOBIT
Sinobit.build.core=nRF5
Sinobit.build.variant=Sinobit
Sinobit.build.extra_flags=-DNRF51
Sinobit.build.ldscript=nrf51_xxaa.ld

Sinobit.build.lfclk_flags=-DUSE_LFRC

Sinobit.menu.softdevice.none=None
Sinobit.menu.softdevice.none.softdevice=none

Sinobit.menu.softdevice.s110=S110
Sinobit.menu.softdevice.s110.softdevice=s110
Sinobit.menu.softdevice.s110.softdeviceversion=8.0.0
Sinobit.menu.softdevice.s110.upload.maximum_size=151552
Sinobit.menu.softdevice.s110.build.extra_flags=-DNRF51 -DS110 -DNRF51_S110
Sinobit.menu.softdevice.s110.build.ldscript=armgcc_s110_nrf51822_xxaa.ld

Sinobit.menu.softdevice.s130=S130
Sinobit.menu.softdevice.s130.softdevice=s130
Sinobit.menu.softdevice.s130.softdeviceversion=2.0.1
Sinobit.menu.softdevice.s130.upload.maximum_size=151552
Sinobit.menu.softdevice.s130.build.extra_flags=-DNRF51 -DS130 -DNRF51_S130
Sinobit.menu.softdevice.s130.build.ldscript=armgcc_s130_nrf51822_xxaa.ld

DWM1001-DEV.name=decaWave DWM1001 Module Development Board

DWM1001-DEV.upload.tool=sandeepmistry:openocd
DWM1001-DEV.upload.protocol=jlink
DWM1001-DEV.upload.target=nrf52
DWM1001-DEV.upload.maximum_size=524288
DWM1001-DEV.upload.setup_command=transport select swd;
DWM1001-DEV.upload.use_1200bps_touch=false
DWM1001-DEV.upload.wait_for_upload_port=false
DWM1001-DEV.upload.native_usb=false

DWM1001-DEV.bootloader.tool=sandeepmistry:openocd

DWM1001-DEV.build.mcu=cortex-m4
DWM1001-DEV.build.f_cpu=16000000
DWM1001-DEV.build.board=DWM1001_DEV
DWM1001-DEV.build.core=nRF5
DWM1001-DEV.build.variant=DWM1001-DEV
DWM1001-DEV.build.extra_flags=-DNRF52
DWM1001-DEV.build.float_flags=-mfloat-abi=hard -mfpu=fpv4-sp-d16
DWM1001-DEV.build.ldscript=nrf52_xxaa.ld

DWM1001-DEV.build.lfclk_flags=-DUSE_LFXO

DWM1001-DEV.menu.softdevice.none=None
DWM1001-DEV.menu.softdevice.none.softdevice=none

DWM1001-DEV.menu.softdevice.s132=S132
DWM1001-DEV.menu.softdevice.s132.softdevice=s132
DWM1001-DEV.menu.softdevice.s132.softdeviceversion=2.0.1
DWM1001-DEV.menu.softdevice.s132.upload.maximum_size=409600
DWM1001-DEV.menu.softdevice.s132.build.extra_flags=-DNRF52 -DS132 -DNRF51_S132
DWM1001-DEV.menu.softdevice.s132.build.ldscript=armgcc_s132_nrf52832_xxaa.ld

SeeedArchLink.name=Seeed Arch Link

SeeedArchLink.upload.tool=sandeepmistry:openocd
SeeedArchLink.upload.target=nrf51
SeeedArchLink.upload.protocol=cmsis-dap
SeeedArchLink.upload.maximum_size=262144

SeeedArchLink.bootloader.tool=sandeepmistry:openocd

SeeedArchLink.build.mcu=cortex-m0
SeeedArchLink.build.f_cpu=16000000
SeeedArchLink.build.board=ARCHLINK
SeeedArchLink.build.core=nRF5
SeeedArchLink.build.variant=SeeedArchLink
SeeedArchLink.build.extra_flags=-DNRF51
SeeedArchLink.build.ldscript=nrf51_xxaa.ld

SeeedArchLink.build.lfclk_flags=-DUSE_LFXO

SeeedArchLink.menu.softdevice.none=None
SeeedArchLink.menu.softdevice.none.softdevice=none

SeeedArchLink.menu.softdevice.s110=S110
SeeedArchLink.menu.softdevice.s110.softdevice=s110
SeeedArchLink.menu.softdevice.s110.softdeviceversion=8.0.0
SeeedArchLink.menu.softdevice.s110.upload.maximum_size=151552
SeeedArchLink.menu.softdevice.s110.build.extra_flags=-DNRF51 -DS110 -DNRF51_S110
SeeedArchLink.menu.softdevice.s110.build.ldscript=armgcc_s110_nrf51822_xxaa.ld

SeeedArchLink.menu.softdevice.s130=S130
SeeedArchLink.menu.softdevice.s130.softdevice=s130
SeeedArchLink.menu.softdevice.s130.softdeviceversion=2.0.1
SeeedArchLink.menu.softdevice.s130.upload.maximum_size=151552
SeeedArchLink.menu.softdevice.s130.build.extra_flags=-DNRF51 -DS130 -DNRF51_S130
SeeedArchLink.menu.softdevice.s130.build.ldscript=armgcc_s130_nrf51822_xxaa.ld